
; Exemplo.s
; Desenvolvido para a placa EK-TM4C1294XL
; Esquele de um novo Projeto para Keil
; Prof. Guilherme de S. Peron	- 12/03/2018
; Prof. Marcos E. P. Monteiro	- 12/03/2018
; Prof. DaLuz           		- 25/02/2022
;---------------------------------------------------------------------------------

; Declarações EQU
; <NOME>	EQU <VALOR>
;---------------------------------------------------------------------------------

	AREA    |.text|, CODE, READONLY, ALIGN=2
	THUMB

; Se alguma função do arquivo for chamada em outro arquivo	
    EXPORT Start					; Permite chamar a função Start a partir de 
									; outro arquivo. No caso startup.s
								
; Se chamar alguma função externa	
;	IMPORT <func>          			; Permite chamar dentro deste arquivo uma função <func>
;---------------------------------------------------------------------------------

Start

	;A -------------------------------------------------------------------------
	
		MOV  R0, #10

	;B -------------------------------------------------------------------------
	
		MOV  R1, 0XCC22
		MOVT R1, 0XFF11
	
	;C -------------------------------------------------------------------------
	
		MOV R2, #1234
	
	;D -------------------------------------------------------------------------
	
		MOV R3, 0X300
		
	;E -------------------------------------------------------------------------
	
		PUSH {R0}
	
	;F -------------------------------------------------------------------------
	
		PUSH {R1-R3}
	
	;G -------------------------------------------------------------------------
	;H -------------------------------------------------------------------------
	
		MOV R1, #60
	
	;I -------------------------------------------------------------------------
	
		MOV R2, 0X1234
	
	;J -------------------------------------------------------------------------
	
		POP{R1-R3}
		POP{R0}
		
; Final do código aqui ---------------------------------------------------------

    NOP
    ALIGN                       	;garante que o fim da seção está alinhada 
    END                         	;fim do arquivo
